EDT/УТ/src/InformationRegisters/СтатусыСкладскогоУчета/СтатусыСкладскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыСкладскогоУчета</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусСкладскогоУчета</name>
    <type>
      <types>CatalogRef.СтатусыСкладскогоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыЗаказа/ДополнительныеПараметрыЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыЗаказа</name>
  <resources>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкладМагазина</name>
    <type>
      <types>CatalogRef.СкладыМагазинов</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтклоненияЗаказа</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </resources>
  <resources>
    <name>ЧастичныйВыкупЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СОжиданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентомИзмененное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>okey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтрихкодOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>nameOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозвратЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодъемОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РасстояниеОтБазыПоДорогам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </resources>
  <resources>
    <name>ПравилоСопоставленияКатегории</name>
    <type>
      <types>CatalogRef.ПравилаСопоставленияКатегорийЗаказовДляРасчетаЗП</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительноеЗакрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйНомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДСФЗПоДоставке</name>
    <type>
      <types>CatalogRef.СтавкиНДСФЗ54</types>
    </type>
  </resources>
  <resources>
    <name>EmailКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МетодОплатыПодъемаЗаказа</name>
    <type>
      <types>EnumRef.МетодыОплатыПодъёмаЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>ТарифнаяСеткаПодъемаЗаказов</name>
    <type>
      <types>CatalogRef.ТарифыПодъемаЗаказовНаЭтаж</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП_Миго</name>
    <type>
      <types>CatalogRef.мгКатегорииЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>СхемаЛогистическихБрейков</name>
    <type>
      <types>CatalogRef.СхемыЛогистическихБрейков</types>
    </type>
  </resources>
  <resources>
    <name>ЛогистическийБрейк</name>
    <type>
      <types>CatalogRef.ЛогистическиеБрейки</types>
    </type>
  </resources>
  <resources>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучательЗаказа</name>
    <type>
      <types>CatalogRef.ПолучателиЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяПредъявлениеУдостоверяющегоДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифРасчетаСтоимостиДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НегабаритныйЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодписаниеИВозвратСопрДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Агрегатор</name>
    <type>
      <types>CatalogRef.Маркетплейсы</types>
    </type>
  </resources>
  <resources>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПунктПВЗ</name>
    <type>
      <types>CatalogRef.ПунктыПВЗ</types>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияЗаказа</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>СсылкаНаОтслеживание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСозданияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ГабаритнаяХарактеристикаОпределенияЛогБрейка</name>
    <type>
      <types>EnumRef.ГабаритныеХарактеристикиЗаказа</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/СтатусыСкладскогоУчета/СтатусыСкладскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыСкладскогоУчета</name>
  <predefined>
    <items>
      <name>Возврат1</name>
      <description>Возврат 1</description>
    </items>
    <items>
      <name>Возврат2</name>
      <description>Возврат 2</description>
    </items>
    <items>
      <name>ВозвратОтправлен</name>
      <description>Возврат отправлен</description>
    </items>
    <items>
      <name>ВозвратПринятМагазином</name>
      <description>Возврат принят магазином</description>
    </items>
    <items>
      <name>ЗаказВернулсяСРегионаНаТерминалПриемки</name>
      <description>Заказ вернулся с региона на терминал приемки</description>
    </items>
    <items>
      <name>ЗаказВыполнен</name>
      <description>Заказ выполнен</description>
    </items>
    <items>
      <name>ЗаказНеВозвратный</name>
      <description>Заказ не возвратный</description>
    </items>
    <items>
      <name>ОтменаСтатуса</name>
      <description>Отмена статуса</description>
    </items>
    <items>
      <name>ПодготовленКВозврату</name>
      <description>Подготовлен к возврату</description>
    </items>
    <items>
      <name>ПриходЕстьНаСканере</name>
      <description>Приход есть на сканере</description>
    </items>
    <items>
      <name>ПриходПодтвержден</name>
      <description>Приход подтвержден</description>
    </items>
    <items>
      <name>ПриходПодтвержденПриходнымДокументом</name>
      <description>Приход подтвержден приходным документом</description>
    </items>
    <items>
      <name>ПриходПроверен</name>
      <description>Приход проверен</description>
    </items>
    <items>
      <name>УчтеноРасхождение</name>
      <description>Учтено расхождение</description>
    </items>
  </predefined>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.СтатусыЗаказов</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/CommonForms/СводнаяИнфорамацияПоЕщеНевозвращеннымЗаказам/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаС = ТекущаяДата();
	ЗадатьПараметрыДляСписка();
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьПараметрыДляСписка()
	Список.Параметры.УстановитьЗначениеПараметра("ДатаКон", КонецДня(ДатаС));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНач", ДобавитьМесяц(ДатаС,-3));
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗадатьПараметрыДляСписка();
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТабДок = СформироватьТаб(Элементы.Список.ТекущиеДанные.ЗаказВладелецТовара,
			Элементы.Список.ТекущиеДанные.Регион, Элементы.Список.ТекущиеДанные.СкладВозврата);
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция СформироватьТаб(Контр,Регион,Склад)
	ТабДок = Новый ТабличныйДокумент;

	Результат = ПолучитьРезультатЗапроса(Контр);
	
	Макет = ПолучитьОбщийМакет("СводнаяИнфорамацияПоЕщеНевозвращеннымЗаказам");
	// Заголовок
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Шапка);
	Область = Макет.ПолучитьОбласть("Строка");
	Для Каждого ТекСтрока Из Результат Цикл
		Если ТекСтрока.СкладВозврата = Склад И ТекСтрока.Регион = Регион Тогда 
			Область.Параметры.Дата = Формат(ТекСтрока.Дата, "ДЛФ=Д");
			Область.Параметры.НомерЗаказа = ТекСтрока.ЗаказНомер;
			Область.Параметры.ВнешнийНомер = ТекСтрока.ЗаказНомерВнешнегоЗаказа;
			Область.Параметры.СтатусСкладскогоУчета = ТекСтрока.ТекущийСтатус;
			ТабДок.Вывести(Область);
		КонецЕсли;
	КонецЦикла;
	Возврат ТабДок
КонецФункции

&НаСервере
Функция ПолучитьРезультатЗапроса(Контр)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыСкладскогоУчета.Заказ КАК Заказ,
		|	МАКСИМУМ(СтатусыСкладскогоУчета.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_срез
		|ИЗ
		|	РегистрСведений.СтатусыСкладскогоУчета КАК СтатусыСкладскогоУчета
		|ГДЕ
		|	СтатусыСкладскогоУчета.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И (СтатусыСкладскогоУчета.Заказ.ВладелецТовара = &Контр
		|			ИЛИ СтатусыСкладскогоУчета.Заказ.ВладелецТовара.Родитель.ОсновнойМагазин = &Контр)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтатусыСкладскогоУчета.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_срез.Заказ КАК Заказ,
		|	СтатусыСкладскогоУчета.ТипЗаказа КАК ТипЗаказа,
		|	СтатусыСкладскогоУчета.СтатусСкладскогоУчета КАК СтатусСкладскогоУчета
		|ПОМЕСТИТЬ ВТ_Статусы
		|ИЗ
		|	ВТ_срез КАК ВТ_срез
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыСкладскогоУчета КАК СтатусыСкладскогоУчета
		|		ПО ВТ_срез.Заказ.Ссылка = СтатусыСкладскогоУчета.Заказ.Ссылка
		|			И ВТ_срез.Период = СтатусыСкладскогоУчета.Период
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		|		ПО (ВТ_срез.Заказ.Ссылка = ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
		|ГДЕ
		|	(СтатусыСкладскогоУчета.СтатусСкладскогоУчета = ЗНАЧЕНИЕ(Справочник.СтатусыСкладскогоУчета.Возврат1)
		|			ИЛИ СтатусыСкладскогоУчета.СтатусСкладскогоУчета = ЗНАЧЕНИЕ(Справочник.СтатусыСкладскогоУчета.Возврат2))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_срез.Заказ,
		|	СтатусыСкладскогоУчета.СтатусСкладскогоУчета,
		|	СтатусыСкладскогоУчета.ТипЗаказа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатусыСкладскогоУчета.Заказ КАК Заказ,
		|	СтатусыСкладскогоУчета.СтатусСкладскогоУчета КАК ТекущийСтатус,
		|	СтатусыСкладскогоУчета.ТипЗаказа КАК ТипЗаказа,
		|	СтатусыСкладскогоУчета.Заказ.ВладелецТовара КАК Контрагент,
		|	СтатусыСкладскогоУчета.Заказ.Номер КАК ЗаказНомер,
		|	СтатусыСкладскогоУчета.Заказ.НомерВнешнегоЗаказа КАК ЗаказНомерВнешнегоЗаказа,
		|	СтатусыСкладскогоУчета.Заказ.Дата КАК Дата,
		|	ДополнительныеПараметрыЗаказа.СкладМагазина КАК СкладВозврата,
		|	СтатусыСкладскогоУчета.Заказ.ТерминалПриема КАК Регион
		|ИЗ
		|	ВТ_Статусы КАК СтатусыСкладскогоУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		|		ПО СтатусыСкладскогоУчета.Заказ = ДополнительныеПараметрыЗаказа.Заказ
		|ГДЕ
		|	(СтатусыСкладскогоУчета.Заказ.СтатусИнтернетМагазина = 3
		|			ИЛИ СтатусыСкладскогоУчета.Заказ.СтатусИнтернетМагазина = 4)";
	
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаС));
	Запрос.УстановитьПараметр("ДатаНач", ДобавитьМесяц(ДатаС,-3));
	Запрос.УстановитьПараметр("Контр", Контр);
	
	Возврат Запрос.Выполнить().Выгрузить();		
Конецфункции

&НаКлиенте
Процедура ЗаполнитьДок(ВозвратМ)
	Контр = Элементы.Список.ТекущиеДанные.ЗаказВладелецТовара;
	Если  Контр <> Неопределено Тогда
		СкладМаг = Элементы.Список.ТекущиеДанные.СкладВозврата;
		ТабЗн = ПолучитьРезультатЗапроса(Контр);
		
		Отбор = Новый Структура;
    	Отбор.Вставить("СкладВозврата", СкладМаг);
        Отбор.Вставить("Регион", Элементы.Список.ТекущиеДанные.Регион);
		Отбор.Вставить("ТекущийСтатус", ВозвратМ);
    	КопияТаб = ТабЗн.Скопировать(Отбор);
		
		Если КопияТаб.Количество() = 0 Тогда
			Предупреждение("Нет данных для создания документа");	
		Иначе
			Форма = ОткрытьФорму("Документ.НаборнаяВедомостьДляВозврата.Форма.ФормаДокумента", Новый Структура);
			Форма.ЗаполнитьОсновныеСерверМ(Контр,ВозвратМ,СкладМаг);
		    Форма.ЗаполнитьСерверМ(КопияТаб, Ложь);
			Форма.Модифицированность = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДляВозврат1(Команда)
	ЗаполнитьДок(Справочники.СтатусыСкладскогоУчета.Возврат1);
КонецПроцедуры

&НаКлиенте
Процедура ДляВозврат2(Команда)
	ЗаполнитьДок(Справочники.СтатусыСкладскогоУчета.Возврат2);
КонецПроцедуры
